namespace BigProject.Managers
{
    /// <summary>
    /// Интерфейс для сохраняемых/загружаемых объектов. 
    /// Для успешной записи/загрузки сохраняемые параметры должны быть public ИЛИ serializable.
    /// Важно: встроенная JsonUtility работает только с простыми данными, списками и одномерными массивами.
    /// При необходимости записи сложных стрктур - можно завернуть их в подклассы.
    /// </summary>
    public interface ISavable
    {
        /// <summary>
        /// Уникальный ключ, по которому будет записан объект внутри сохранения (у самого сохранения один единый ключ).
        /// </summary>
        string Key { get; }

        /// <summary>
        /// Данные для сохранения, запакованные в объект.
        /// Если все public и serializable поля класса необходимо записывать - возвращаем this;
        /// </summary>
        object SavingData { get; }

        /// <summary>
        /// Выхывается после загрузки данных в объект.
        /// </summary>
        void OnLoad() { }
    }
}